In [8]:
import pandas as pd
import numpy as np

path = "Players.csv"

df = pd.read_csv(path)

In [10]:
df.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [25]:

df.loc[1:4,'Player':'weight']

          Player  height  weight
1   Cliff Barker   188.0    83.0
2  Leo Barnhorst   193.0    86.0
3     Ed Bartels   196.0    88.0
4    Ralph Beard   178.0    79.0

In [36]:



"""
Diferença entre loc e iloc

loc[]   : Indexado literalmente (palavras)
iloc[]  : Indexado Numericamente (igual listas) 
"""

'\nDiferença entre loc e iloc\n\nloc[]   : Indexado literalmente (palavras)\niloc[]  : Indexado Numericamente (igual listas) \n'

In [39]:
df.iloc[0:4,2:7]

   height  weight                          collage    born birth_city
0   180.0    77.0               Indiana University  1918.0        NaN
1   188.0    83.0           University of Kentucky  1921.0   Yorktown
2   193.0    86.0         University of Notre Dame  1924.0        NaN
3   196.0    88.0  North Carolina State University  1925.0        NaN